Revit 2026 API

# AssetSet Methods

---

The AssetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear |  |
|  | Contains |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase |  |
|  | ForwardIterator |  |
|  | GetEnumerator |  |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert |  |
|  | ReverseIterator |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

AssetSet Class

Autodesk.Revit.DB.Visual Namespace